import html from 'utils';
import Md from '@/components/markdown/index.js';
import { ref, onMounted, watch } from 'vue';
import { useUserStore } from '@/store/index.js';
import Editor from '@/components/editor/index.js';
import Chart from '@/components/chart/index.js';
import mqtt from 'mqtt';

const template = html`<el-row><md name="home" /></el-row>
  <el-row><editor v-model="model" upload-url="file/upload" /> </el-row>
  <el-row><chart :options="options" width="400px" height="200px" /></el-row>
  <h2>CKEditor</h2>`;

const labels = new Map([
  ['A13', '设备状态'],
  ['A01', '当班产量'],
  ['A02', '任务进度'],
  ['A04', '不良品数'],
  ['A06', '运行时长'],
  ['A07', '停止时长'],
  ['A09', '性能稼动率'],
  ['A0O', '当模产量'],
  ['A10', '良品率'],
  ['A101', '关模一段压力'],
  ['A102', '关模一段速度'],
  ['A103', '关模二段压力'],
  ['A104', '关模二段速度'],
  ['A105', '关模三段压力'],
  ['A106', '关模三段速度'],
  ['A107', '关模低压压力'],
  ['A108', '关模低压速度'],
  ['A109', '关模高压压力'],
  ['A11', '设备综合效率'],
  ['A110', '关模高压速度'],
  ['A111', '开模一段压力'],
  ['A112', '开模一段速度'],
  ['A113', '开模二段压力'],
  ['A114', '开模二段速度'],
  ['A115', '开模三段压力'],
  ['A116', '开模三段速度'],
  ['A117', '开模四段压力'],
  ['A118', '开模四段速度'],
  ['A119', '开模五段压力'],
  ['A12', '当前效率'],
  ['A120', '开模五段速度'],
  ['A121', '再循环计时'],
  ['A122', '模具冷却计时'],
  ['A123', '射出一段压力'],
  ['A124', '射出一段速度'],
  ['A125', '射出一段位置'],
  ['A126', '射出二段压力'],
  ['A127', '射出二段速度'],
  ['A128', '射出二段位置'],
  ['A129', '射出三段压力'],
  ['A130', '射出三段速度'],
  ['A131', '射出三段位置'],
  ['A132', '射出四段压力'],
  ['A133', '射出四段速度'],
  ['A134', '射出四段位置'],
  ['A135', '射出五段压力'],
  ['A136', '射出五段速度'],
  ['A137', '射出五段位置'],
  ['A138', '射出六段压力'],
  ['A139', '射出六段速度'],
  ['A140', '射出六段位置'],
  ['A141', '转保压选择'],
  ['A142', '氡个們縄固羥纳保压位置设定'],
  ['A143', '转保压压力设定'],
  ['A144', '转保压时间设定'],
  ['A145', '保压一段压力'],
  ['A146', '保压一段速度'],
  ['A147', '保压一段时间'],
  ['A148', '保压二段压力'],
  ['A149', '保压二段速度'],
  ['A15', '输出压力'],
  ['A150', '保压二段时间'],
  ['A151', '保压三段压力'],
  ['A152', '保压三段速度'],
  ['A153', '保压三段时间'],
  ['A154', '保压四段压力'],
  ['A155', '保压四段速度'],
  ['A156', '保压四段时间'],
  ['A157', '保压五段压力'],
  ['A158', '保压五段速度'],
  ['A159', '保压五段时间'],
  ['A16', '输出速度'],
  ['A160', '保压六段压力'],
  ['A161', '保压六段速度'],
  ['A162', '保压六段时间'],
  ['A163', '储料一段压力'],
  ['A164', '储料一段背压'],
  ['A165', '储料一段速度'],
  ['A166', '储料一段位置'],
  ['A167', '储料二段压力'],
  ['A168', '储料二段背压'],
  ['A169', '储料二段速度'],
  ['A17', '输出背压'],
  ['A170', '储料二段位置'],
  ['A171', '储料三段压力'],
  ['A172', '储料三段背压'],
  ['A173', '储料三段速度'],
  ['A174', '储料三段位置'],
  ['A175', '储料四段压力'],
  ['A176', '储料四段背压'],
  ['A177', '储料四段速度'],
  ['A178', '储料四段位置'],
  ['A179', '储料五段压力'],
  ['A18', '射出位置'],
  ['A180', '储料五段背压'],
  ['A181', '储料五段速度'],
  ['A182', '储料五段位置'],
  ['A183', '储料六段压力'],
  ['A184', '储料六段背压'],
  ['A185', '储料六段速度'],
  ['A186', '储料六段位置'],
  ['A187', '射退压力'],
  ['A188', '射退速度'],
  ['A189', '射退位置距离'],
  ['A19', '推力座位置'],
  ['A190', '储前位置距离'],
  ['A191', '再次储料位置'],
  ['A193', '射退模式0储1冷'],
  ['A194', '储料冷却'],
  ['A195', '托模进一段压力'],
  ['A196', '托模进一段速度'],
  ['A197', '托模进一段位置'],
  ['A198', '托模进二段压力'],
  ['A199', '托模进二段速度'],
  ['A20', '托模位置'],
  ['A200', '托模进二段位置'],
  ['A201', '托模退一段压力'],
  ['A202', '托模退一段速度'],
  ['A203', '托模退一段位置'],
  ['A204', '托模退二段压力'],
  ['A205', '托模退二段速度'],
  ['A206', '托模退二段位置'],
  ['A21', '座台位置'],
  ['A210', '托模进延时时间'],
  ['A211', '托模退延时时间'],
  ['A212', '座台进一段压力'],
  ['A213', '座台进一段速度'],
  ['A214', '座台进一段位置'],
  ['A215', '座台进二段压力'],
  ['A216', '座台进二段速度'],
  ['A217', '座台进二段位置'],
  ['A218', '座台待 1'],
  ['A219', '座台待 2'],
  ['A22', '检测压力'],
  ['A220', '座台退一段压力'],
  ['A221', '座台退一段速度'],
  ['A222', '座台退一段位置'],
  ['A223', '座台退二段压力'],
  ['A224', '鲦彎驂饲壘贱台退二段速度'],
  ['A225', '座台退二段位置'],
  ['A226', '座台进时间'],
  ['A227', '座台退延时'],
  ['A228', '座台退时间'],
  ['A23', '温度一段'],
  ['A237', '中子 A进压力'],
  ['A238', '中子 A 进速度'],
  ['A239', '中子A进动作时间'],
  ['A24', '温度二段'],
  ['A240', '中頫嘭子A进绞牙计数'],
  ['A241', '中子A 退压力'],
  ['A242', '中子 A退速度'],
  ['A243', '中子A退动作时间'],
  ['A244', '中子A退绞牙计数'],
  ['A245', '中子 A退绞牙退 2'],
  ['A246', '中子 B 进压力'],
  ['A247', '中子B进速度'],
  ['A248', '中子B进动作时间'],
  ['A249', '中子B进绞牙计数'],
  ['A25', '温度三段'],
  ['A250', '中子B退压力'],
  ['A251', '中子 B 退速度'],
  ['A252', '中子B退动作时间'],
  ['A253', '中子B退绞牙计数'],
  ['A254', '中子C进压力'],
  ['A255', '中子C进速度'],
  ['A256', '中子C进动作时间'],
  ['A257', '中子C进绞牙计数'],
  ['A258', '中子C退压力'],
  ['A259', '中子C退速度'],
  ['A26', '温度四段'],
  ['A260', '中子C退动作时间'],
  ['A261', '中子C退绞牙计数'],
  ['A262', '中子D进压力待用'],
  ['A263', '中子D进速度待用'],
  ['A264', '中子D进动作时间'],
  ['A265', '中子D进绞牙计数'],
  ['A266', '中子D退压力待用'],
  ['A267', '中子D退速度待用'],
  ['A268', '中子D退动作时间'],
  ['A269', '中子D退绞牙计数'],
  ['A27', '温度五段'],
  ['A270', '温一设定'],
  ['A271', '温二设定'],
  ['A272', '温三设定'],
  ['A273', '温四设定'],
  ['A274', '温五设定'],
  ['A275', '温六设定'],
  ['A276', '温七设定'],
  ['A277', '温八设定'],
  ['A278', '温九设定'],
  ['A279', '温十设定'],
  ['A28', '温度六段'],
  ['A280', '温十一设定'],
  ['A281', '温十二设定'],
  ['A282', '温十三设定'],
  ['A283', '温十四设定'],
  ['A284', '温一上限'],
  ['A285', '温二上限'],
  ['A286', '温三上限'],
  ['A287', '温四上限'],
  ['A288', '温五上限'],
  ['A289', '温六上限'],
  ['A29', '温度七段'],
  ['A290', '温七上限'],
  ['A291', '温八上限'],
  ['A292', '温九上限'],
  ['A293', '温十上限'],
  ['A294', '温十一上限'],
  ['A295', '温十二上限'],
  ['A296', '温十三上限'],
  ['A297', '温度十四上限'],
  ['A298', '温一下限'],
  ['A299', '温二下限'],
  ['A30', '應欖怵豰度八段'],
  ['A300', '温三下限'],
  ['A301', '温四下限'],
  ['A302', '温五下限'],
  ['A303', '温六下限'],
  ['A304', '温七下限'],
  ['A305', '温八下限'],
  ['A306', '温九下限'],
  ['A307', '温十下限'],
  ['A308', '温十一下限'],
  ['A309', '温十二下限'],
  ['A31', '温度九段'],
  ['A31', '温度十四下限'],
  ['A310', '温十三下限'],
  ['A32', '温度十段'],
  ['A33', '温度十一段'],
  ['A332', '故障代码 1'],
  ['A333', '故障代码 2'],
  ['A334', '故障代码 3'],
  ['A335', '故障代码 4'],
  ['A336', '故障代码 5'],
  ['A337', '故障代码 6'],
  ['A338', '故障代码 7'],
  ['A339', '故障代码 8'],
  ['A34', '温度十二段'],
  ['A340', '故障代码 9'],
  ['A341', '故障代码 10'],
  ['A342', '故障代码 11'],
  ['A343', '故障代码 12'],
  ['A344', '故障代码 13'],
  ['A345', '故障代码 14'],
  ['A346', '故障代码 15'],
  ['A347', '故障代码 16'],
  ['A35', '温度十三段'],
  ['A353', '理论周期'],
  ['A354', '计划产量'],
  ['A355', '射出标定'],
  ['A356', '换班次数'],
  ['A357', '首班时分'],
  ['A358', '模穴数'],
  ['A359', '时间校准'],
  ['A36', '温度十四段'],
  ['A361', '开模标定'],
  ['A37', '油温'],
  ['A38', '上模射出计时'],
  ['A40', '上模转保压时间'],
  ['A42', '上模储料计时'],
  ['A44', '上模关模计时'],
  ['A45', '上模低压计时'],
  ['A46', '上模高压计时'],
  ['A47', '上模推力座位置'],
  ['A48', '上模开模计时'],
  ['A49', '模转保压压力'],
  ['A50', '上模射出起点位置'],
  ['A51', '上模保压转换位置'],
  ['A52', '上模射出终点位置'],
  ['A53', '上模射出监控位置'],
  ['A55', '上模射退计时'],
  ['A56', '上模托模计时'],
  ['A57', '上模射出尖压'],
  ['A58', '上模储料尖压'],
  ['A59', '上模最大射速'],
  ['A60', '上模取件计时'],
  ['A90', '当模运行时间'],
  ['A91', '当模停止时间'],
  ['A93', '上模循环计时'],
  ['AO1', '当班产量'],
  ['AO8', '时间稼动率'],
  ['A00', '当模产量'],
  //
  ['D01', '性能稼动率'],
  ['D02', '良品率'],
  ['D03', '设备综合效率'],
  ['D04', '当前效率'],
  ['D05', '该模模数'],
  ['D05', '当模产量'],
  ['D06', '当班模数'],
  ['D06', '当班产量'],
  ['D0O', '时间稼动率'],
  ['D27', '上模周期'],
  ['D31', '运行时间'],
  ['D31', '运行时长'],
  ['D32', '停止时间'],
  ['D32', '停止时长'],
  ['D33', '合模时间'],
  ['D34', '射胶时间'],
  ['D35', '冷却时间'],
  ['D36', '设备状态'],
  ['D37', '状态'],
  ['D37', '设备状态'],
  ['D38', '开模时间'],
  ['D40', '任务进度'],
  ['D41', '预计完成'],
  ['D42', '不良品数'],
  ['D50', '换模'],
  ['D51', '备用'],
  ['D54', '不良品数'],
  ['D55', '理论周期'],
  ['D56', '计划产量'],
  ['D57', '射出标定'],
  ['D58', '班次次数'],
  ['D59', '首班时间'],
  ['D60', '模穴数'],
  ['D61', '时间校准'],
  ['D62', '备用'],
  ['D63', '开模标定'],
]);

export default {
  components: { Md, Editor, Chart },
  template: html`<h2>设备列表</h2>
    <el-row :gutter="20">
      <el-col :span="12" v-for="[key,value] in testModel" :key="key">
        <el-card>
          <template #header>
            <div class="card-header">
              <span>{{key}}</span>
            </div>
          </template>
          <el-descriptions :column="4">
            <el-descriptions-item v-for="(value2,key2) in value.Data" :label="labels.get(key2)??key2">
              {{value2}}
            </el-descriptions-item>
          </el-descriptions>
          <template #footer>{{value.time}}</template>
        </el-card>
      </el-col>
    </el-row> `,
  setup() {
    const userStore = useUserStore();
    const testModel = ref(new Map());
    onMounted(async () => {
      await userStore.getUserInfo();
      const clientId = 'mqtt_web';

      const host = `ws://${window.location.host}:8083/mqtt`;

      const options = {
        keepalive: 60,
        clientId: clientId,
        protocolId: 'MQTT',
        protocolVersion: 4,
        clean: true,
        reconnectPeriod: 1000,
        connectTimeout: 30 * 1000,
      };
      console.log('Connecting mqtt client');
      const client = mqtt.connect(host, options);

      client.on('connect', () => {
        console.log('已连接:' + clientId);
        // Subscribe
        client.subscribe('testtopic', { qos: 0 });
      });

      client.on('message', (topic, message, packet) => {
        console.log(`收到${topic}消息: `);
        const value = message.toString();
        console.log(value);
        const jsonObject = JSON.parse(value);
        console.log(jsonObject);
        testModel.value.set(jsonObject.id, jsonObject);
      });

      client.on('error', (err) => {
        console.log('连接异常: ', err);
        client.end();
      });

      client.on('reconnect', () => {
        console.log('重新连接...');
      });
    });

    const model = ref('');
    watch(model, () => {
      console.log(model.value);
    });

    const options = {
      title: {
        text: '基础折线图',
      },
      xAxis: {
        type: 'category',
        data: ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'],
      },
      yAxis: {
        type: 'value',
      },
      series: [
        {
          data: [150, 230, 224, 218, 135, 147, 260],
          type: 'line',
        },
      ],
    };

    return {
      model,
      labels,
      testModel,
    };
  },
};
